mdhardenburgh/Blinky/Packages/.cache/Keil.LPC54000_DFP.2.7.0.pdsc
          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
          </sequences>
        </device>

        <!-- *************************  Device 'LPC54101J256UK49'  ***************************** -->
        <device Dname="LPC54101J256UK49">
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC54101.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

          <feature type="UART"          n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="39"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>

          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
          </sequences>

        </device>

        <!-- *************************  Device 'LPC54101J512BD64'  ***************************** -->
        <device Dname="LPC54101J512BD64">
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC54101.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

          <feature type="UART"          n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="SPI"           n="2"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="50"/>
          <feature type="QFP"           n="64"        name="Low-Profile QFP Package"/>

          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor">
              <block>
                Sequence("ResetProcessor_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet">
              <block>
                Sequence("ResetCatchSet_LPC5410x_M4_SingleCore");
              </block>
            </sequence>

            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
          </sequences>
        </device>

        <!-- *************************  Device 'LPC54101J512UK49'  ***************************** -->
        <device Dname="LPC54101J512UK49">
          <compile header="LPCOpen/lpc5410x/chip_5410x/inc/chip.h" define="CHIP_LPC5410X"/>
          <debug svd="SVD/LPC54101.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x02000000" size="0x00010000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x02010000" size="0x00008000" init   ="0" default="1"/>
          <algorithm Pname="M4" name="Flash/LPC5410x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <book name="Documents/LPC5410X.pdf" title="LPC5410x Datasheet"/>
          <book name="Documents/UM10850.pdf"  title="LPC5410x User manual"/>

