mdhardenburgh/Blinky/Packages/.cache/Keil.LPC54000_DFP.2.7.0.pdsc
          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor" Pname="M4">
              <block>
                Sequence("ResetProcessor_LPC5411x_M4");
              </block>
            </sequence>

            <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
            <sequence name="ResetProcessor" Pname="M0plus">
              <block>
                Sequence("ResetProcessor_LPC5411x_M0");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet" Pname="M4">
              <block>
                Sequence("ResetCatchSet_LPC5411x_M4");
              </block>
            </sequence>

            <!--ResetCatchSet Sequence for Cortex-M0-->
            <sequence name="ResetCatchSet" Pname="M0plus">
              <block>
                Sequence("ResetCatchSet_LPC5411x_M0");
              </block>
            </sequence>


            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart"  Pname="M4">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
            <sequence name="TraceStart"  Pname="M0plus">
              <block>

              </block>
            </sequence>

          </sequences>

        </device>

        <!-- *************************  Device 'LPC54114J256UK49'  ***************************** -->
        <device Dname="LPC54114J256UK49">
          <processor Pname="M0plus" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="100000000"/>
          <environment Pname="M0plus" name="uv">
            <CMisc>-DCORE_M0PLUS</CMisc>
          </environment>
          <compile header="LPCOpen/lpc5411x/chip_5411x/inc/chip.h" define="CHIP_LPC5411X"/>
          <debug Pname="M4"     svd="SVD/LPC54114_cm4.svd"/>
          <debug Pname="M0plus" svd="SVD/LPC54114_cm0plus.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5411x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <book Pname="M0plus" name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
          <book name="Documents/LPC5411X.pdf" title="LPC5411x Datasheet"/>
          <book name="Documents/UM10914.pdf"  title="LPC5411x User manual"/>

          <feature type="MPSerial"      n="8"          name="Flexcomm Serial Peripheral Module: USART, SPI, I2C"/>
          <feature type="USBD"          n="1"          name="Full-Speed USB Device"/>
          <feature type="ComOther"      n="1"          name="DMIC Subsystem"/>
          <feature type="ADC"           n="12"       m="12"/>
          <feature type="TempSens"      n="1"/>
          <feature type="Timer"         n="5"        m="32"/>
          <feature type="PWM"           n="1"/>
          <feature type="Temp"          n="-40"      m="105"/>
          <feature type="VCC"           n="1.62"     m="3.60"/>
          <feature type="IOs"           n="37"/>
          <feature type="CSP"           n="49"         name="Wafer-Level Chip-Scale Package"/>

          <debug Pname="M4" __dp="0" __ap="0"/>             <!-- AP 0 for Cortex-M4  -->
          <debug Pname="M0plus" __dp="0" __ap="1"/>         <!-- AP 1 for Cortex-M0+ -->

          <sequences>
            <!-- Begin: ResetProcessor Sequence for Cortex-M4 -->
            <sequence name="ResetProcessor" Pname="M4">
              <block>
                Sequence("ResetProcessor_LPC5411x_M4");
              </block>
            </sequence>

            <!-- Begin: ResetProcessor Sequence for Cortex-M0-->
            <sequence name="ResetProcessor" Pname="M0plus">
              <block>
                Sequence("ResetProcessor_LPC5411x_M0");
              </block>
            </sequence>

            <!-- ResetCatchSet Sequence for Cortex-M4 -->
            <sequence name="ResetCatchSet" Pname="M4">
              <block>
                Sequence("ResetCatchSet_LPC5411x_M4");
              </block>
            </sequence>

            <!--ResetCatchSet Sequence for Cortex-M0-->
            <sequence name="ResetCatchSet" Pname="M0plus">
              <block>
                Sequence("ResetCatchSet_LPC5411x_M0");
              </block>
            </sequence>


            <!-- Override for Pre-Defined TraceStart Sequence -->
            <sequence name="TraceStart"  Pname="M4">
              <block>
                Sequence("TraceStart_CM4");
              </block>
            </sequence>
            <sequence name="TraceStart"  Pname="M0plus">
              <block>

              </block>
            </sequence>

          </sequences>

        </device>

      </subFamily>

      <!-- ************************  Subfamily 'LPC54600'  **************************** -->
      <subFamily DsubFamily="LPC54600">
        <processor Pname="M4" Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="180000000"/>

        <description>
The LPC5460x is a family of ARM Cortex-M4 based microcontrollers for embedded applications featuring a rich peripheral set with very low power consumption and enhanced debug features.
        </description>

        <!--compile Pname="M4" define="CORE_M4"/> With compile it is only possible to set one define.
                                                  using environment is a hack to be able to set an additional define -->
        <environment Pname="M4" name="uv">
          <CMisc>-DCORE_M4</CMisc>
        </environment>

        <debugvars configfile="Debug/LPC5460x.dbgconf">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var LPC541xx_SWO_Pin = 0;                         // Serial Wire Output pin: 0 = PIO0_15, 1 = PIO1_1
          __var Dbg_CR           = 0x00000000;                // DBG_CR
          __var sCPU_ImageEntry  = 0xFFFFFFFF;                // Slave CPU Image Start Entry
        </debugvars>

