mdhardenburgh/Blinky/Packages/.cache/Keil.LPC54000_DFP.2.7.0.pdsc
        <sequences>
          <!-- ResetCatchSet Sequence for Cortex-M4 -->
          <sequence name="ResetCatchSet" Pname="M4">
            <block>
              Sequence("ResetCatchSet_LPC5460x_M4");
            </block>
          </sequence>

          <!-- Override for Pre-Defined TraceStart Sequence -->
          <sequence name="TraceStart"  Pname="M4">
            <block>
              Sequence("TraceStart_CM4");
            </block>
          </sequence>
        </sequences>

        <book Pname="M4" name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book name="Documents/LPC546XX.pdf" title="LPC546XX Datasheet"/>
        <book name="Documents/UM10912.pdf"  title="LPC546XX User manual"/>
        <description>
The LPC5460x is a family of ARM Cortex-M4 based microcontrollers for embedded applications featuring a rich peripheral set with very low power consumption and enhanced debug features.
        </description>

        <!-- *************************  Device 'LPC54608J512BD208'  ***************************** -->
        <device Dname="LPC54608J512BD208">
          <compile header="Device/Include/LPC54608.h" define="LPC54608"/>
          <debug svd="SVD/LPC54608.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54608J512ET180'  ***************************** -->
        <device Dname="LPC54608J512ET180">
          <compile header="Device/Include/LPC54608.h" define="LPC54608"/>
          <debug svd="SVD/LPC54608.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54607J512ET180'  ***************************** -->
        <device Dname="LPC54607J512ET180">
          <compile header="Device/Include/LPC54607.h" define="LPC54607"/>
          <debug svd="SVD/LPC54607.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54607J256BD208'  ***************************** -->
        <device Dname="LPC54607J256BD208">
          <compile header="Device/Include/LPC54607.h" define="LPC54607"/>
          <debug svd="SVD/LPC54607.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54607J256ET180'  ***************************** -->
        <device Dname="LPC54607J256ET180">
          <compile header="Device/Include/LPC54607.h" define="LPC54607"/>
          <debug svd="SVD/LPC54607.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54606J512BD208'  ***************************** -->
        <device Dname="LPC54606J512BD208">
          <compile header="Device/Include/LPC54606.h" define="LPC54606"/>
          <debug svd="SVD/LPC54606.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54606J256ET180'  ***************************** -->
        <device Dname="LPC54606J256ET180">
          <compile header="Device/Include/LPC54606.h" define="LPC54606"/>
          <debug svd="SVD/LPC54606.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54605J512ET180'  ***************************** -->
        <device Dname="LPC54605J512ET180">
          <compile header="Device/Include/LPC54605.h" define="LPC54605"/>
          <debug svd="SVD/LPC54605.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54605J256ET180'  ***************************** -->
        <device Dname="LPC54605J256ET180">
          <compile header="Device/Include/LPC54605.h" define="LPC54605"/>
          <debug svd="SVD/LPC54605.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54616J256ET180'  ***************************** -->
        <device Dname="LPC54616J256ET180">
          <compile header="Device/Include/LPC54616.h" define="LPC54616"/>
          <debug svd="SVD/LPC54616.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00018000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_256.FLM" start="0x00000000" size="0x00040000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54616J512BD208'  ***************************** -->
        <device Dname="LPC54616J512BD208">
          <compile header="Device/Include/LPC54616.h" define="LPC54616"/>
          <debug svd="SVD/LPC54616.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

        <!-- *************************  Device 'LPC54618J512ET180'  ***************************** -->
        <device Dname="LPC54618J512ET180">
          <compile header="Device/Include/LPC54618.h" define="LPC54618"/>
          <debug svd="SVD/LPC54618.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

        <!-- *************************  Device 'LPC54618J512BD208'  ***************************** -->
        <device Dname="LPC54618J512BD208">
          <compile header="Device/Include/LPC54618.h" define="LPC54618"/>
          <debug svd="SVD/LPC54618.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="QFP"           n="208"/>
        </device>

