mdhardenburgh/Blinky/Packages/.cache/Keil.LPC54000_DFP.2.7.0.pdsc
    <condition id="LPC54606 CM4 IAR">
      <description>NXP LPC54606 CM4 Devices and the IAR compiler</description>
      <require condition="LPC54606 CM4"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC54607 CM4 ARMCC">
      <description>NXP LPC54607 CM4 Devices and the ARM compiler</description>
      <require condition="LPC54607 CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC54607 CM4 IAR">
      <description>NXP LPC54607 CM4 Devices and the IAR compiler</description>
      <require condition="LPC54607 CM4"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC54608 CM4 ARMCC">
      <description>NXP LPC54608 CM4 Devices and the ARM compiler</description>
      <require condition="LPC54608 CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC54608 CM4 IAR">
      <description>NXP LPC54608 CM4 Devices and the IAR compiler</description>
      <require condition="LPC54608 CM4"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC5410x CMSIS">
      <description>NXP LPC5410x Devices and CMSIS-CORE</description>
      <require condition="LPC5410x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5411x CMSIS">
      <description>NXP LPC5411x Devices and CMSIS-CORE</description>
      <require condition="LPC5411x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC5460x CMSIS">
      <description>NXP LPC5460x Devices and CMSIS-CORE</description>
      <require condition="LPC5460x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC54616 CMSIS">
      <description>NXP LPC54616 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54616*"/>
    </condition>

    <condition id="LPC54618 CMSIS">
      <description>NXP LPC54618 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54618*"/>
    </condition>

    <condition id="LPC54628 CMSIS">
      <description>NXP LPC54628 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept  Dname="LPC54628*"/>
    </condition>

    <!-- Device + CMSIS + LPCOpen Conditions -->
    <condition id="LPC541xx CMSIS LPCOPEN">
      <description>NXP LPC541xx Devices and LPCOpen firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5410x CMSIS LPCOPEN">
      <description>NXP LPC5410x Devices and LPCOpen firmware</description>
      <require condition="LPC5410x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5411x CMSIS LPCOPEN">
      <description>NXP LPC5411x Devices and LPCOpen firmware</description>
      <require condition="LPC5411x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC541xx CMSIS LPCOPEN_BSP">
      <description>NXP LPC541xx Devices and LPCOpen board support firmware</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
      <deny Cclass="Compiler" Cgroup="I/O"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="LPC541xx CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5410x CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="LPC5410x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5411x CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="LPC5411x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver SAI">
      <description>Requirement for CMSIS SAI Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <condition id="LPC5410x CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="LPC5410x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC5411x CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="LPC5411x CMSIS LPCOPEN"/>
    </condition>

    <condition id="LPC541xx CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="LPC5411x CMSIS"/>
      <require Cclass="Device" Cgroup="LPCOpen"/>
    </condition>

    <!-- Device + CMSIS Driver -->
    <condition id="LPC541xx I2C">
      <description>Requirement for components using CMSIS I2C driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="LPC541xx SPI">
      <description>Requirement for components using CMSIS SPI driver</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI"/>
    </condition>

    <condition id="LPC541xx I2C SAI">
      <description>Requirement for components using CMSIS I2C and SAI drivers</description>
      <require condition="LPC541xx"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI"/>
    </condition>

    <!-- Board support Conditions -->
    <condition id="MCB54110 Audio common Mic">
      <description>Requirement for MCB54110 Audio microphone </description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Microphone"/>
    </condition>
