mdhardenburgh/Blinky/Packages/.cache/Keil.LPC54000_DFP.2.7.0.pdsc
      <component Cgroup="LPCOpen" condition="LPC541xx CMSIS LPCOPEN_BSP"> <!-- must not have  Cversion="3.01.000" here as the bundle version rules -->
      <description>LPCOpen board support code for LPCXpresso54102 board</description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BOARD_SUPPORT_LPCOPEN
        </RTE_Components_h>
        <files>
          <file category="include" condition="LPC5410x"            name="LPCOpen/lpc5410x/lpcxpresso_54102/inc/"/>
          <file category="header"  condition="LPC5410x"            name="LPCOpen/lpc5410x/lpcxpresso_54102/inc/board.h"/>
          <file category="library" condition="LPC5410x CM4 ARMCC"  name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_board_lpcxpresso_54102/keil_output/core_m4/lib_board_lpcxpresso_lpc54102.lib" src="LPCOpen/lpc5410x/lpcxpresso_54102/src/"/>
          <file category="library" condition="LPC5410x CM0+ ARMCC" name="LPCOpen/lpc5410x/prj_lpcxpresso_54102/keil/lib_board_lpcxpresso_54102_m0/keil_output/core_m0/lib_board_lpcxpresso_54102_m0.lib" src="LPCOpen/lpc5410x/lpcxpresso_54102/src/"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso5411x Board Support-->
    <bundle Cbundle="LPCXpresso54114" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso54114 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC5411x CMSIS">
        <description>LED driver for NXP LPCXpresso54114 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54114/Common/LED_LPCXpresso54114.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC5411x CMSIS">
        <description>Buttons interface for NXP LPCXpresso54114 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54114/Common/Buttons_LPCXpresso54114.c"/>
        </files>
      </component>
      <component Cgroup="LPCOpen" condition="LPC541xx CMSIS LPCOPEN_BSP">  <!-- must not have  Cversion="3.01.000" here as the bundle version rules -->
      <description>LPCOpen board support code for LPCXpresso54114 board</description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BOARD_SUPPORT_LPCOPEN
        </RTE_Components_h>
        <files>
          <file category="include" condition="LPC5411x"            name="LPCOpen/lpc5411x/brd_xpresso54114/inc/"/>
          <file category="header"  condition="LPC5411x"            name="LPCOpen/lpc5411x/brd_xpresso54114/inc/board.h"/>
          <file category="library" condition="LPC5411x CM4 ARMCC"  name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_board_lpcxpresso_54114/keil_output/core_m4/lib_board_lpcxpresso_54114.lib" src="LPCOpen/lpc5411x/lpcxpresso_54114/src/"/>
          <file category="library" condition="LPC5411x CM0+ ARMCC" name="LPCOpen/lpc5411x/prj_xpresso54114/keil/lib_board_lpcxpresso_54114_m0/keil_output/core_m0/lib_board_lpcxpresso_54114_m0.lib" src="LPCOpen/lpc5411x/lpcxpresso_54114/src/"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso54608 Board Support-->
    <bundle Cbundle="LPCXpresso54608" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso54608 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC5460x CMSIS">
        <description>LED driver for NXP LPCXpresso54608 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54608/Common/LED_LPCXpresso54608.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC5460x CMSIS">
        <description>Buttons interface for NXP LPCXpresso54608 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54608/Common/Buttons_LPCXpresso54608.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="Keil" name="MCB54110" revision="Ver 1.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB54110=ON">
      <description>Keil MCB54110 Development Board</description>
      <image small="Documents/mcb54110_small.png" large="Documents/mcb54110_large.png"/>
      <book category="overview"  name="http://www.keil.com/boards2/keil/mcb54110/" title="MCB54110 Evaluation Board Web Page"/>
      <book category="setup"     name="Documents/MCB54110_QSG.pdf" title="MCB54110 Quick Start Guide"/>
      <!--
      <book category="schematic" name="Documents/mcb54110v1-0-schematics.pdf" title="MCB54110 Schematics"/>
      <book category="manual"    name="Documents/mcb54110.chm" title="User Manual"/>
      -->
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC54114J256BD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC54110"/>
      <feature type="PWR"             n="1"              name="USB Powered"/>
      <feature type="ROM"             n="1"              name="8 MB SPI Flash"/>
      <feature type="MemCard"         n="1"              name="microSD Card Holder"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (micro USB Device connectors)"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LineIn"          n="1"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="1"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="ConnOther"       n="1"              name="On-board Speaker"/>
      <feature type="Button"          n="4"              name="Push-Buttons: Reset, ISP0, ISP1, WAKEUP"/>
      <feature type="LED"             n="8"              name="I/O Port LEDs"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPCXpresso54102" revision="Rev. A" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso54102 Board</description>
      <image small="Boards/NXP/LPCXpresso54102/Documents/LPCXpresso54102_small.png"
             large="Boards/NXP/LPCXpresso54102/Documents/LPCXpresso54102_large.png"/>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13077.html"                         title="LPCXpresso Board for the LPC54100 family of MCUs"/>
      <book category="schematic" name="Boards/NXP/LPCXpresso54102/Documents/LPCX54102_Schematic_RevA.pdf" title="LPCXpresso54102 Schematics"/>
      <book category="manual"    name="Boards/NXP/LPCXpresso54102/Documents/UM10855-om13077.pdf"          title="LPCXpresso54102 User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC54102J512BD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC54100"/>
      <feature type="XTAL"            n="1200000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="3"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP button"/>
      <feature type="ArduinoFF"       n="1"/>
      <feature type="ConnOther"       n="1"              name="FTDI compatible interface"/>
      <feature type="ConnOther"       n="1"              name="PMOD compatible interface"/>
      <feature type="ODbg"            n="1"              name="LPC-Link2"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

